{"youtube":[{"title":"Il valore umano che l'IA non può replicare [Armando Bisogno]","link":"https://www.youtube.com/watch?v=vSJJ7Qz-0Ok","Summary":"L'intervista esplora il rapporto tra intelligenza artificiale e discipline umanistiche, mettendo in discussione il valore del lavoro intellettuale in un'era in cui la macchina potrebbe assumere ruoli tradizionalmente umani. Armando Bisogno riflette su come lo studio del passato aiuti a comprendere le rivoluzioni tecnologiche moderne e sottolinea l'importanza della responsabilità, della storia e dell'unicità umana. Il dibattito tocca argomenti come la verità come mediazione sociale, la creatività, i deepfake e il futuro delle professioni intellettuali.","source":"youtube::Raffaele Gaito"},{"title":"TROPPA PRIVACY PER APPLE: la multa di 100M da parte dell'Antitrust #1510","link":"https://www.youtube.com/watch?v=u2v_iQuqjmg","Summary":"Apple è stata multata di oltre 98 milioni di euro dall’Antitrust italiano per aver utilizzato le normative sulla privacy per limitare la concorrenza. La decisione è già entrata in vigore, con Apple che ha 60 giorni per presentare un ricorso. L’obiettivo potrebbe essere di obbligare l’azienda a gestire i dati pubblicitari in modo simile a quelli di altri servizi, mettendo a rischio la privacy degli utenti e aprendo un nuovo scontro tra GDPR e regole antitrust.","source":"youtube::Ciao Internet - Matteo Flora"}],"reddit":[{"title":"AI clears World's Toughest Math Exam: AxiomProver achieves 12/12 on Putnam 2025","link":"https://www.reddit.com/r/singularity/comments/1q8inxe/ai_clears_worlds_toughest_math_exam_axiomprover/","Summary":"AxiomProver has autonomously solved all 12 problems from the 2025 Putnam Competition using formal Lean proofs with no human hints. The Putnam is widely regarded as the hardest undergraduate math exam, with median human scores often at 0 or 1. The solutions are formally verified, mechanically checked, and the proofs are publicly released with visualizations and human vs AI comparisons.","source":"reddit::singularity","relevance":10,"reason":"This post qualifies as high relevance because it reports a verifiable factual achievement (AI solving a real-world math competition with formal verification), provides concrete details about the event (Putnam 2025 exam, 12/12 score), and includes sources (blog, GitHub, X) confirming the substantive claim. It avoids opinion, speculation, or subjective analysis."},{"title":"NVIDIA CEO Jensen Huang: AI bubble myth,Energy and why billion robots are inevitable","link":"https://www.reddit.com/r/singularity/comments/1q8ez9e/nvidia_ceo_jensen_huang_ai_bubble_mythenergy_and/","Summary":"The post summarizes key insights from Jensen Huang's interview on NVIDIA's 2026 outlook, including efficiency gains in AI, predictions about robotics, digital biology, job impacts, energy needs, and the AI bubble narrative. It cites specific data points and references the NoPriors Podcast as the source.","source":"reddit::singularity","relevance":9,"reason":"The post presents factual information about NVIDIA's CEO's statements on AI progress, efficiency, robotics, and energy, supported by specific figures (e.g., 5x-10x efficiency gains, 100 trillion GDP context) and a cited source. While it includes predictions, these are framed as corporate outlooks rather than speculative opinions."},{"title":"Ilya Sutskever had $4 billion of vested OpenAI equity in 2023","link":"https://www.reddit.com/r/singularity/comments/1q8lhhr/ilya_sutskever_had_4_billion_of_vested_openai/","Summary":". submitted by /u/the_smart_girl [link](https://www.theinformation.com/briefings/ilya-sutskever-4-billion-vested-openai-equity-2023) [comments](https://www.reddit.com/r/singularity/comments/1q8lhhr/ilya_sutskever_had_4_billion_of_vested_openai/)","source":"reddit::singularity","relevance":10,"reason":"The post shares factual news about Ilya Sutskever's vested equity in OpenAI, citing a credible source (The Information) and presenting verifiable financial details without opinion or speculation."},{"title":"How AI will finally break the \"Medical License Moat\": A Case Study of South Korea’s Professional Cartel","link":"https://www.reddit.com/r/singularity/comments/1q88k3z/how_ai_will_finally_break_the_medical_license/","Summary":"We often talk about AI taking blue-collar or entry-level white-collar jobs. But in South Korea, AI is about to hit the ultimate 'Final Boss': The Medical Monopoly. Currently, Korea is facing a massive crisis where even 7-year-olds are in 'Med-school prep classes' because the wage premium for AI/STEM is broken. The elite have built a fortress of scarcity. But here is the twist: AI doesn't need to replace doctors to win. It just needs to empower the 'mid-tier' (Nurses/PAs). In a broke, aging society with a 0.7 birth rate, the government will inevitably choose 'AI + Nurses' over expensive, striking specialists. This isn't just a Korean story. It's a preview of how professional 'moats' built on artificial scarcity evaporate when technology democratizes expertise. (I’ve analyzed the data and the AI-driven disruption of this 'Fortress' in more detail here: https://youtu.be/GfQFd9E-5AM)","source":"reddit::singularity","relevance":7,"reason":"The post discusses a real-world scenario in South Korea where AI could disrupt the medical profession by empowering mid-tier staff rather than replacing specialists. It references socioeconomic trends, workforce dynamics, and technological disruption, though includes predictive analysis and some speculative elements about future implications."},{"title":"Hyundai’s Atlas humanoid wins Best Robot at CES 2026, moves toward factory deployment","link":"https://www.reddit.com/r/singularity/comments/1q81mh1/hyundais_atlas_humanoid_wins_best_robot_at_ces/","Summary":"Hyundai-owned Boston Dynamics 'Atlas' humanoid has won the Best Robot award at CES 2026 for demonstrating real-world autonomy. Judges highlighted its ability to walk, balance, manipulate objects, and adapt in real time using AI-driven control. Hyundai confirmed Atlas is factory-ready with phased deployment planned at manufacturing plants starting in 2028. Source: Interesting Engineering","source":"reddit::singularity","relevance":10,"reason":"The post reports on a verified factual event (CES 2026 award), presents specific technical capabilities of the robot, and includes concrete deployment plans from Hyundai. It avoids opinion, speculation, or commentary, focusing solely on documented developments and official announcements."},{"title":"The first two model builder IPOs - Z.AI and MiniMax","link":"https://www.reddit.com/r/singularity/comments/1q8lgsw/the_first_two_model_builder_ipos_zai_and_minimax/","Summary":"Z.AI went public yesterday, MiniMax today - both at HKSE.","source":"reddit::singularity","relevance":10,"reason":"The post reports on factual events (IPOs of Z.AI and MiniMax) with verifiable information about their public listing dates and exchange. It presents new information about concrete happenings without incorporating opinion, analysis, or speculative content."},{"title":"Oxford Economics finds that \"firms don't appear to be replacing workers with AI on a significant scale\" suggesting that companies are using the tech as cover for routine layoffs","link":"https://www.reddit.com/r/singularity/comments/1q7rm1u/oxford_economics_finds_that_firms_dont_appear_to/","Summary":"Oxford Economics finds that \"firms don't appear to be replacing workers with AI on a significant scale\" suggesting that companies are using the tech as cover for routine layoffs. [Link to Fortune article]","source":"reddit::singularity","relevance":9,"reason":"The post presents a study by Oxford Economics (a reputable research firm) with specific findings about AI adoption in firms. It references a documented event (AI usage vs. layoffs) and includes a link to a news article corroborating the claim. The content is factual and informational, focusing on verifiable research rather than opinions or speculation."},{"title":"OpenAI is developing \"ChatGPT Jobs\" — Career AI agent designed to help users with resume,Job search & career guidance","link":"https://www.reddit.com/r/singularity/comments/1q8mhcm/openai_is_developing_chatgpt_jobs_career_ai_agent/","Summary":"Use Jobs to explore roles, improve your resume and plan your next steps\n\n- Get help improving your resume and positioning.\n- Clarify what roles fit you and how to stand out.\n- Search and compare opportunities that match your goals.\n\nSource: Beta testers in X","source":"reddit::singularity","relevance":9,"reason":"The post reports on OpenAI's development of a new AI tool for career guidance, citing beta testers as the source. While the content includes product features, it presents factual information about an official development without opinion or speculation."},{"title":"New group of potential diabetes drugs with fewer side effects can reprogram insulin-resistant cells to be healthier","link":"https://www.reddit.com/r/singularity/comments/1q7t0pa/new_group_of_potential_diabetes_drugs_with_fewer/","Summary":"A research study on new potential diabetes drugs with fewer side effects, focusing on PPARγ agonists and their structural improvements. The post describes experimental findings in mice and human adipocytes, including binding potency, mechanism insights, and clinical relevance.","source":"reddit::singularity","relevance":10,"reason":"The post presents factual scientific research with verifiable methods (biochemical assays, HDX, computational modeling) and results (enhanced binding, insulin sensitivity improvements). It avoids opinion, speculation, or subjective commentary, aligning with high relevance criteria for factual news and substantive content."},{"title":"Hierarchies work for storage, but not for discovery.","link":"https://www.reddit.com/r/softwarearchitecture/comments/1q86rlj/hierarchies_work_for_storage_but_not_for_discovery/","Summary":"The post discusses a technical problem with hierarchical structures in a diagnostic system, providing specific examples of how hierarchical storage fails when users search through symptom-driven paths. It details the issue, tests, and proposed solution without personal opinions or rants.","source":"reddit::softwarearchitecture","relevance":10,"reason":"The post presents a documented technical problem with concrete examples, analysis of system design flaws, and tested solutions. It avoids speculation, opinion, or subjective commentary, focusing on a verifiable issue in knowledge management systems."}]}