{"youtube":[{"title":"Il valore umano che l'IA non può replicare [Armando Bisogno]","link":"https://www.youtube.com/watch?v=vSJJ7Qz-0Ok","Summary":"Armando Bisogno, filosofo, esplora come l'intelligenza artificiale impatta le discipline umanistiche e il valore del lavoro intellettuale. Analizza il concetto di fatica vs valore, sottolineando che l'AI costringe a ripensare cosa renda unico l'essere umano. Discute argomenti come verità, fake news, creatività e il futuro della scrittura nell'era degli LLM.","source":"youtube::Raffaele Gaito"},{"title":"TROPPA PRIVACY PER APPLE: la multa di 100M da parte dell'Antitrust #1510","link":"https://www.youtube.com/watch?v=u2v_iQuqjmg","Summary":"Apple è stata multata di 98 milioni di euro dall’Antitrust italiano per aver utilizzato le norme sulla privacy per limitare la concorrenza. La decisione potrebbe obbligare Apple a modificare la gestione dei dati degli utenti su iOS, con implicazioni per la privacy e il monopolio digitale. Il dibattito si concentra sul conflitto tra tutela degli utenti e difesa del dominio di Apple, in un contesto di nuove regole europee.","source":"youtube::Ciao Internet - Matteo Flora"}],"reddit":[{"title":"one of the top submitters in the nvfp4 competition has never hand written GPU code before","link":"https://www.reddit.com/r/singularity/comments/1q8clmf/one_of_the_top_submitters_in_the_nvfp4/","Summary":"One of the top submitters in the NVFP4 competition has never hand written GPU code before.","source":"reddit::singularity","relevance":8,"reason":"The post shares factual information about a specific competition participant's background, presenting a concrete detail without opinion or speculation. While not breaking news, it provides substantive information about a documented event (competition submission)."},{"title":"AI clears World's Toughest Math Exam: AxiomProver achieves 12/12 on Putnam 2025","link":"https://www.reddit.com/r/singularity/comments/1q8inxe/ai_clears_worlds_toughest_math_exam_axiomprover/","Summary":"AxiomProver has autonomously solved all 12 problems from the 2025 Putnam Competition using formal Lean proofs with no human hints. The Putnam is widely regarded as the hardest undergraduate math exam. Median human scores are often 0 or 1. This is not answer guessing. Every solution is formally verified. The proofs are mechanically checked end to end. Axiom has released the full Lean proofs along with visualizations and direct human vs AI comparisons.","source":"reddit::singularity","relevance":10,"reason":"The post reports on an actual achievement by AxiomProver in solving the Putnam Competition, a documented event with verifiable results and sources. It presents factual information about the AI's performance, the exam's difficulty, and the verification method, without mixing opinion or analysis."},{"title":"NVIDIA CEO Jensen Huang: AI bubble myth,Energy and why billion robots are inevitable","link":"https://www.reddit.com/r/singularity/comments/1q8ez9e/nvidia_ceo_jensen_huang_ai_bubble_mythenergy_and/","Summary":"I watched the new interview of Jensen Huang on NoPriors Podcast. This was a dense 2026 outlook on reasoning models robotics energy and why AI is not a bubble. High signal takeaways only. 1) The billion x Token efficiency curve: Jensen says AI progress is no longer driven by raw scale alone. The real driver is compounded efficiency gains across hardware model architecture and algorithms. NVIDIA is seeing roughly 5x to 10x efficiency gains every year. Over a decade this compounds into a billion fold reduction in cost per token. This is why demand keeps expanding instead of collapsing. He confirms the \"Rubin platform\" continues the annual refresh cycle with another major step change. 2) Physical AI and a billion robots: Jensen predicts a future with a billion robots. Everything that moves becomes robotic. Cars, factories, excavators, logistics. This creates an entirely new global economy around robot maintenance repair and operations, potentially one of the largest industries on earth. On autonomy he explains self driving is shifting from scripted systems to end to end reasoning, allowing vehicles to handle scenarios they were never explicitly trained on. 3) \"Digital biology\" gets its ChatGPT moment: Jensen expects a ChatGPT style breakthrough for protein and chemical generation. AI moves from predicting biology to generating it. NVIDIA is building foundation models for cells and proteins to create a data flywheel for drug discovery and materials science. 4) The Jobs myth task Vs Purpose: Jensen directly challenges the job loss narrative. He uses radiology as the example. AI automated the task of scanning but expanded the human role in diagnosis and research. As productivity increases demand increases with it. NVIDIA continues hiring aggressively despite deep automation. 5) Energy and geopolitics reality: Jensen argues US China decoupling is unrealistic. Research ecosystems remain deeply coupled and advances flow both ways. On energy he is blunt. Solar and wind alone are not enough. AI factories will require natural gas and small modular nuclear reactors to scale. With global GDP around 100 trillion dollars, even a small shift toward AI powered factories creates trillions in permanent infrastructure demand. 6 Why the AI bubble narrative is wrong: Jensen compares AI to electrification. Every platform shift looks irrational early. The real bottleneck is no longer intelligence but how fast we can build energy efficient compute factories. Entire industries are approaching their ChatGPT moment. TLDR AI progress is now driven by efficiency and inference not just scale. Robotics & Physical AI unlock real world GDP. Energy and compute scale together. The AI bubble narrative misunderstands platform transitions. Source: No Priors 🔗: https://youtu.be/k-xtmISBCNE?si=R0wDbTFBYw2dFi-J","source":"reddit::singularity","relevance":10,"reason":"The post presents factual information from a CEO interview discussing NVIDIA's strategic outlook on AI advancements, including specific technical predictions about token efficiency, robotics, energy requirements, and industry impacts. It includes verifiable data points (e.g., 5x-10x efficiency gains, 100 trillion dollar GDP context) and references an official source (NoPriors podcast). The content focuses on documented technological trajectories and economic implications rather than subjective opinions or commentary."},{"title":"Atlas has its own moves","link":"https://www.reddit.com/r/singularity/comments/1q7q039/atlas_has_its_own_moves/","Summary":"Atlas has its own moves","source":"reddit::singularity","relevance":7,"reason":"The post appears to reference a significant development or capability related to Atlas (possibly an AI system or robot), which could align with factual news in the context of technological advancements. However, without explicit sources or context, the factual nature remains somewhat ambiguous."},{"title":"Ilya Sutskever had $4 billion of vested OpenAI equity in 2023","link":"https://www.reddit.com/r/singularity/comments/1q8lhhr/ilya_sutskever_had_4_billion_of_vested_openai/","Summary":". submitted by /u/the_smart_girl [link] [comments]","source":"reddit::singularity","relevance":10,"reason":"The post reports on a factual event (Ilya Sutskever's $4 billion vested OpenAI equity) with a verifiable source link, presenting new information about a documented financial milestone rather than opinion or speculation."},{"title":"Big Change in artificialanalysis.ai benchmarks","link":"https://www.reddit.com/r/singularity/comments/1q8b3pp/big_change_in_artificialanalysisai_benchmarks/","Summary":"Hello guys, Did you notice the benchmark results changed drastically on artificialanalysis.ai. Earlier I remember gmini 3.0 pro was the best mode with scroe around I think 73 but now the best model is not gemini 3 but GPT 5.2 its score is 51. So something has changed here. Anyone has an idea of what happened?","source":"reddit::singularity","relevance":7,"reason":"The post reports on a change in benchmark results from artificialanalysis.ai, which is a documented event. It presents factual information about model performance shifts but includes a question seeking potential explanations, which introduces some analysis."},{"title":"Terence Tao's Write-up of GPT-5.2 Solving Erdos Problem #728","link":"https://www.reddit.com/r/singularity/comments/1q7u78b/terence_taos_writeup_of_gpt52_solving_erdos/","Summary":"In the last week, me and AcerFur on X used GPT-5.2 to resolve Erdos Problem #728, marking the first time an LLM has resolved an Erdos problem not previously resolved by a Human. I did a detailed write-up of the process yesterday on this sub, however I just came to find out Terence Tao has posted a much more in-depth write-up of the process, in a more Mathematics centric way. Those mathematicians among you might want to check it out as, like I stated in my previous post, I'm not a mathematician by trade, so my write-up could be slightly flawed. I'm posting this here as he also talks about how LLMs have genuinely increased in capabilities in the previous months. I think it goes towards GPT-5.2's efficacy, as it's my opinion that GPT-5.2 is the only LLM that could have accomplished this currently.","source":"reddit::singularity","relevance":7,"reason":"The post reports on a specific event (LLM solving an Erdos problem) and mentions Terence Tao's related analysis, which adds credibility. However, it includes subjective opinions about GPT-5.2's uniqueness and potential flaws in the user's own write-up, which reduces its factual weight."},{"title":"Hyundai’s Atlas humanoid wins Best Robot at CES 2026, moves toward factory deployment","link":"https://www.reddit.com/r/singularity/comments/1q81mh1/hyundais_atlas_humanoid_wins_best_robot_at_ces/","Summary":"Hyundai-owned Boston Dynamics 'Atlas' humanoid has won the Best Robot award at CES 2026 for demonstrating real-world autonomy rather than scripted or pre-programmed demos. Judges highlighted Atlas ability to walk, balance, manipulate objects and adapt in real time using continuous sensor feedback and AI-driven control, even in unpredictable industrial environments. Unlike most humanoid robots focused on demonstrations or lab settings, Atlas is being built for practical deployment, including factory work and hazardous tasks where human labor is limited or risky. Hyundai has confirmed that Atlas is factory-ready, with phased deployment planned at Hyundai manufacturing plants starting in 2028, signaling a shift from experimental humanoids to commercially usable systems. Source: Interesting Engineering","source":"reddit::singularity","relevance":10,"reason":"The post contains factual news about an actual award (CES 2026) and provides verifiable details about the Atlas robot's capabilities, deployment plans, and Hyundai's confirmation of factory readiness. It avoids opinion, analysis, or speculation by focusing on documented events and official announcements."},{"title":"The first two model builder IPOs - Z.AI and MiniMax","link":"https://www.reddit.com/r/singularity/comments/1q8lgsw/the_first_two_model_builder_ipos_zai_and_minimax/","Summary":"The first two model builder IPOs Z.AI and MiniMax went public on HKSE.","source":"reddit::singularity","relevance":10,"reason":"The post reports on actual events (IPOs of Z.AI and MiniMax) with factual information about their public listing on the HKSE. It provides verifiable details about recent corporate developments without opinion, commentary, or speculation."},{"title":"Oxford Economics finds that \"firms don't appear to be replacing workers with AI on a significant scale\" suggesting that companies are using the tech as cover for routine layoffs","link":"https://www.reddit.com/r/singularity/comments/1q7rm1u/oxford_economics_finds_that_firms_dont_appear_to/","Summary":"Oxford Economics finds that \"firms don't appear to be replacing workers with AI on a significant scale\" suggesting that companies are using the tech as cover for routine layoffs","source":"reddit::singularity","relevance":10,"reason":"The post shares findings from a research study by Oxford Economics, a reputable institution, and presents verifiable data about corporate AI adoption trends. It reports on documented events and avoids personal opinions or speculative analysis."},{"title":"New group of potential diabetes drugs with fewer side effects can reprogram insulin-resistant cells to be healthier","link":"https://www.reddit.com/r/singularity/comments/1q7t0pa/new_group_of_potential_diabetes_drugs_with_fewer/","Summary":"A research study on a new class of diabetes drugs (SR10171 analogs) that show improved insulin sensitivity in mice without adverse effects, citing a published paper with DOI and detailed mechanisms of action.","source":"reddit::singularity","relevance":10,"reason":"The post presents factual research findings from a documented study, including specific results (e.g., 10-100x enhanced binding, testing in human adipocytes) and references a peer-reviewed publication. It avoids opinion, speculation, or subjective analysis, focusing solely on scientific results and their implications for diabetes treatment."},{"title":"Hierarchies work for storage, but not for discovery.","link":"https://www.reddit.com/r/softwarearchitecture/comments/1q86rlj/hierarchies_work_for_storage_but_not_for_discovery/","Summary":"The hierarchy problem showed up fast.\n\nA few weeks ago I shared how I'm building a system to capture workshop diagnostics and surface them when they're useful. Some assumptions didn't survive. This is the next thing that broke.\n\nTL;DR: Hierarchical structures work well for authoritative storage, but fail when users enter through multiple, symptom-driven paths. Conflating storage and discovery creates false negatives even when the knowledge exists.\n\nWhat seemed to work\nThe system captures diagnostic history properly now. Paper job cards → structured data → searchable knowledge. It filters for signal, not noise.\n\nFor isolated problems, it works. Alternator failure, brake pad wear, coolant leak — symptoms map cleanly to single components.\n\nWhere it fell apart\nThe moment I tried to diagnose anything involving multiple systems cooperating, the structure failed.\n\nReal example: No heat from vents\nCustomer complaint: No heat. I search the HVAC folder for heater core issues, blend door faults, A/C compressor problems.\nThe answer exists in the system: heater hose leak at quick-connect fittings. But it's filed under Cooling System, not HVAC. I never find it.\n\nSame fault, three diagnostic paths:\n- No cabin heat → tech searches HVAC folder → not found\n- Engine overheating → tech searches Engine folder → not found\n- Coolant loss → tech searches Cooling folder → found ✓\n\nSuccess rate: 33%. The knowledge exists. Two-thirds of the entry points fail.\n\nThe structural problem\nHierarchical storage forces every piece of knowledge to have a single 'correct' home — even when the problem spans multiple systems.\n\nAuthor decides where it lives based on what the component is (heater hoses = cooling system component).\n\nBut diagnostics doesn't work that way. You search based on what's broken (no heat = HVAC symptom). The mental models don't align.\n\nWorse: Multi-system components\nSome components affect five systems simultaneously.\n\nMulti-function camera: Filed under ADAS. Causes ABS warning lights. Tech searches brake systems, finds nothing.\n\nA significant portion of diagnostic knowledge involves multi-system components. Hierarchy makes them invisible from most entry points.\n\nWhy duplication doesn't work\nFirst instinct: file heater hoses in both Cooling AND HVAC folders.\n\nThis creates:\n- Content drift and maintenance overhead (update one, forget the other)\n- False pattern separation (system thinks the same fault is different problems)\n\nThe insight\nThe problem isn't search. The problem is conflating where knowledge lives with how it's found.\n\nStorage needs:\n- One canonical location (prevents duplication)\n- Clear ownership (prevents drift)\n- Hierarchical structure (author's mental model)\n\nRetrieval needs:\n- Multiple entry points (symptom, system, feature)\n- Non-linear navigation (not forced through one path)\n- User's diagnostic path (not author's filing decision)\n\nThese are different problems. Trying to solve both with one structure fails.\n\nWhat I'm testing\nSeparate the two concerns:\n\nStorage layer: Hierarchical. Heater hoses live in Cooling System folder. One location, one source of truth.\n\nRetrieval layer: Secondary indexing. Knowledge items get indexed by the systems they affect, symptoms they cause, and features they interact with.\n\nThe indexes don't replace hierarchy — they reference it. Hierarchy stays canonical; indexes are just entry points.\n\nSearch \"no heat\" → queries indexes → finds heater hoses (even though they're filed under Cooling).\n\nNavigate Cooling folder → finds heater hoses via hierarchy.\n\nSame knowledge. Multiple discovery paths. Zero duplication.\n\nEarly results\nTesting with multi-system components:\n- Retrieval went from unreliable to consistently fast\n- Duplicate creation dropped to zero\n- Authoring cost increased slightly but predictably\n\nThe knowledge doesn't move. The indexes do.\n\nWhy this might matter\nIf you're building knowledge systems for domains where:\n- One thing affects multiple systems (diagnostics, troubleshooting, incident response)\n- Users don't know the root cause yet (that's what they're diagnosing)\n- Entry points vary (symptom, error code, affected feature)\n\nHierarchical storage probably fails the same way. Not because hierarchies are bad, but because they solve the wrong problem.\n\nStorage and retrieval are different. Conflating them creates false negatives.\n\nStill testing. But the pattern seems real.","source":"reddit::softwarearchitecture","relevance":9,"reason":"The post presents a factual discussion about a technical problem in a diagnostic system, detailing specific issues, examples, and testing results without opinion or speculation. It outlines a documented challenge with hierarchical storage and provides an analysis of the problem's impact and a proposed solution, meeting the primary criteria for factual and substantive content."}]}